examples/flows/compiled/if_all_empty_branches/flow.mmd
flowchart TD
    %% Flow: if_empty_branches_flow

    end_if_empty_branches_flow([end_if_empty_branches_flow])
    handler_finalize[handler_finalize]
    handler_setup[handler_setup]
    router_if_empty_branches_flow_line_14_if_1{{router_if_empty_branches_flow_line_14_if_1}}
    start_if_empty_branches_flow([start_if_empty_branches_flow])

    start_if_empty_branches_flow --> handler_setup
    handler_setup --> router_if_empty_branches_flow_line_14_if_1
    router_if_empty_branches_flow_line_14_if_1 -->|p['skip_processing']| handler_finalize
    handler_finalize --> end_if_empty_branches_flow
